src/CF/Catalogs/ПозицииДляОказанияУслугЗаВремяНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПозицииДляОказанияУслугЗаВремяНомера</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ПозицииДляОказанияУслугЗаВремяНомера/Ext/ObjectModule.bsl
//sza140411-1701 : 
//sza140323-1544  
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления 		
		И НЕ ОбменДанными.Загрузка 
		И ЭтоГруппа 
		И Модифицированность() Тогда  //для группы
		
		Если ЗначениеЗаполнено(ВидЦен) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПозицииДляОказанияУслугЗаВремяНомера.Ссылка
			|ИЗ Справочник.ПозицииДляОказанияУслугЗаВремяНомера КАК ПозицииДляОказанияУслугЗаВремяНомера
			|ГДЕ ПозицииДляОказанияУслугЗаВремяНомера.ВидЦен <> &ВидЦен
			|	И ПозицииДляОказанияУслугЗаВремяНомера.Родитель = &Родитель
			|	И ПозицииДляОказанияУслугЗаВремяНомера.Предопределенный = ЛОЖЬ
			|	И ПозицииДляОказанияУслугЗаВремяНомера.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ВидЦен", ВидЦен);
			Запрос.УстановитьПараметр("Родитель", ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда					
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					СледуетЗаписывать = ЛОЖЬ;
					
					ПозицияОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
					ПозицияОбъект.ВидЦен = ВидЦен;	
					ПозицияОбъект.Записать();
					
				КонецЦикла;
				
				Если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() Тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обновлены параметры для позиций в группе."), , Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры
